app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc).all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Nell"], ["email", "nell@sym.ph"], ["message", "Hello world"], ["created_at", "2018-01-28 19:36:25.270913"], ["updated_at", "2018-01-28 19:36:25.270913"]]